** getting the entries for a root in the correct order

   select bword,nodeId,itype from entry where broot="ktb" order by nodeId;

   you get the itypes in the correct sequence followed by the itype=""
   #+begin_src  sqlite :results output raw
   sqlite3 /home/andrewsg/qt5projects/laneparser/lexicon.sqlite 'select bword,nodeId,itype from entry where broot="ktb" order by nodeId;'
   #+end_src

   #+RESULTS:
   | katabahu     | n36626      |      1 |    |
   | kat~aba      | n36626-1    |      2 |    |
   | mukaAtabapN  | n36627      |      3 |    |
   | Aktb         | n36628      |      4 |    |
   | tkt~b        | n36629      |      5 |    |
   | takaAotaba   | n36629-5    |      6 |    |
   | A_ikotataba  | n36629-5-6  |      8 |    |
   | Astktbhu     | $ayoy^FA    | n36630 | 10 |
   | kutobapN     | n36631      |        |    |
   | kitobapN     | n36632      |        |    |
   | kutubiY~N    | n36633      |        |    |
   | kitaAbN      | n36634      |        |    |
   | qirobapN     | katiybN     | n36635 |    |
   | kitaAbapN    | n36636      |        |    |
   | katiybapN    | n36637      |        |    |
   | kut~aAbN     | n36638      |        |    |
   | kaAtibN      | n36639      |        |    |
   | makotabN     | n36640      |        |    |
   | mukotabN     | n36641      |        |    |
   | mukotibN     | n36642      |        |    |
   | bglp         | makotuwbapN | n36643 |    |
   | mukat~abN    | n36644      |        |    |
   | mukotatabN   | n36645      |        |    |
   | mukotawotibN | n36646      |        |    |
   | kitaAbN      | n42947      |        |    |

